ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/ELM_ELM_527F0000h.xml
<module name="ELM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ELM_REVISION" acronym="ELM_REVISION" offset="0" width="32" description="This register contains the IP revision code.(A write to this register has no effect, the same as the reset).">
		<bitfield id="RESERVED_0" width="24" begin="31" end="8" resetval="0x0" description="Read returns 0" range="31:8" rwaccess="R"/>
	<bitfield id="REV_NUMBER" width="8" begin="7" end="0" resetval="0x32" description="IP revision number [RTL] [7:4] Major revision [3:0] Minor revision" range="7:0" rwaccess="R"/>
	</register><register id="ELM_SYSSTS" acronym="ELM_SYSSTS" offset="20" width="32" description="Internal Reset monitoring (OCP domain)Undefined since:From HW perspective reset state is 0From SW user perspective when module is accessible is 1">
		<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x0" description="Internal Reset monitoring (OCP domain)Undefined since:From HW perspective reset state is 0From SW user perspective when module is accessible is 1" range="0" rwaccess="R"/>
	</register><register id="ELM_IRQSTS" acronym="ELM_IRQSTS" offset="24" width="32" description="Interrupt status. This register doubles as a status register for the error location processes.">
		<bitfield id="PAGE_VALID" width="1" begin="8" end="8" resetval="0x0" description="Error location status for a full page, based on the mask definition Read 0x0: error locations invalid for all polynomials enabled in the ECC_INTERRUPT_MASK register Read 0x1: all error locations valid Write 0x0: no effect Write 0x1: clear interrupt" range="8" rwaccess="R/W1TC"/>
	<bitfield id="LOC_VALID_7" width="1" begin="7" end="7" resetval="0x0" description="Error location status for syndrome polynomial 7 Read 0x0: no syndrome processed or process in progress Read 0x1: error location process completed Write 0x0: no effect Write 0x1: clear interrupt" range="7" rwaccess="R/W1TC"/>
	<bitfield id="LOC_VALID_6" width="1" begin="6" end="6" resetval="0x0" description="Error location status for syndrome polynomial 6" range="6" rwaccess="R/W1TC"/>
	<bitfield id="LOC_VALID_5" width="1" begin="5" end="5" resetval="0x0" description="Error location status for syndrome polynomial 5" range="5" rwaccess="R/W1TC"/>
	<bitfield id="LOC_VALID_4" width="1" begin="4" end="4" resetval="0x0" description="Error location status for syndrome polynomial 4" range="4" rwaccess="R/W1TC"/>
	<bitfield id="LOC_VALID_3" width="1" begin="3" end="3" resetval="0x0" description="Error location status for syndrome polynomial 3" range="3" rwaccess="R/W1TC"/>
	<bitfield id="LOC_VALID_2" width="1" begin="2" end="2" resetval="0x0" description="Error location status for syndrome polynomial 2" range="2" rwaccess="R/W1TC"/>
	<bitfield id="LOC_VALID_1" width="1" begin="1" end="1" resetval="0x0" description="Error location status for syndrome polynomial 1" range="1" rwaccess="R/W1TC"/>
	<bitfield id="LOC_VALID_0" width="1" begin="0" end="0" resetval="0x0" description="Error location status for syndrome polynomial 0" range="0" rwaccess="R/W1TC"/>
	</register><register id="ELM_IRQEN" acronym="ELM_IRQEN" offset="28" width="32" description="Interrupt enable.">
		<bitfield id="PAGE_MASK" width="1" begin="8" end="8" resetval="0x0" description="Page interrupt mask bit0:disable interrupt1:enable interrupt" range="8" rwaccess="R/W"/>
	<bitfield id="LOCATION_MASK_7" width="1" begin="7" end="7" resetval="0x0" description="Error location interrupt mask bit for syndrome polynomial 7" range="7" rwaccess="R/W"/>
	<bitfield id="LOCATION_MASK_6" width="1" begin="6" end="6" resetval="0x0" description="Error location interrupt mask bit for syndrome polynomial 6" range="6" rwaccess="R/W"/>
	<bitfield id="LOCATION_MASK_5" width="1" begin="5" end="5" resetval="0x0" description="Error location interrupt mask bit for syndrome polynomial 5" range="5" rwaccess="R/W"/>
	<bitfield id="LOCATION_MASK_4" width="1" begin="4" end="4" resetval="0x0" description="Error location interrupt mask bit for syndrome polynomial 4" range="4" rwaccess="R/W"/>
	<bitfield id="LOCATION_MASK_3" width="1" begin="3" end="3" resetval="0x0" description="Error location interrupt mask bit for syndrome polynomial 3" range="3" rwaccess="R/W"/>
	<bitfield id="LOCATION_MASK_2" width="1" begin="2" end="2" resetval="0x0" description="Error location interrupt mask bit for syndrome polynomial 2" range="2" rwaccess="R/W"/>
	<bitfield id="LOCATION_MASK_1" width="1" begin="1" end="1" resetval="0x0" description="Error location interrupt mask bit for syndrome polynomial 1" range="1" rwaccess="R/W"/>
	<bitfield id="LOCATION_MASK_0" width="1" begin="0" end="0" resetval="0x0" description="Error location interrupt mask bit for syndrome polynomial 00:disable interrupt1:enable interrupt" range="0" rwaccess="R/W"/>
	</register><register id="ELM_LOCATION_CONFIG" acronym="ELM_LOCATION_CONFIG" offset="32" width="32" description="ECC algorithm parameters.">
		<bitfield id="ECC_SIZE" width="11" begin="26" end="16" resetval="0x0" description="Maximum size of the buffers for which the error location engine is used, in number of nibbles [4-bits entities]" range="26:16" rwaccess="R/W"/>
	<bitfield id="ECC_BCH_LEVEL" width="2" begin="1" end="0" resetval="0x0" description="Error correction level 0x0: 4 bits 0x1: 8 bits 0x2: 16 bits 0x3: reserved" range="1:0" rwaccess="R/W"/>
	</register><register id="ELM_PAGE_CTRL" acronym="ELM_PAGE_CTRL" offset="128" width="32" description="Page definition.">
		<bitfield id="SECTOR_7" width="1" begin="7" end="7" resetval="0x0" description="Set to 1 if syndrome polynomial 7 is part of the page in page mode Must be 0 in continuous mode" range="7" rwaccess="R/W"/>
	<bitfield id="SECTOR_6" width="1" begin="6" end="6" resetval="0x0" description="Set to 1 if syndrome polynomial 6 is part of the page in page mode Must be 0 in continuous mode" range="6" rwaccess="R/W"/>
	<bitfield id="SECTOR_5" width="1" begin="5" end="5" resetval="0x0" description="Set to 1 if syndrome polynomial 5 is part of the page in page mode Must be 0 in continuous mode" range="5" rwaccess="R/W"/>
	<bitfield id="SECTOR_4" width="1" begin="4" end="4" resetval="0x0" description="Set to 1 if syndrome polynomial 4 is part of the page in page mode Must be 0 in continuous mode" range="4" rwaccess="R/W"/>
	<bitfield id="SECTOR_3" width="1" begin="3" end="3" resetval="0x0" description="Set to 1 if syndrome polynomial 3 is part of the page in page mode Must be 0 in continuous mode" range="3" rwaccess="R/W"/>
	<bitfield id="SECTOR_2" width="1" begin="2" end="2" resetval="0x0" description="Set to 1 if syndrome polynomial 2 is part of the page in page mode Must be 0 in continuous mode" range="2" rwaccess="R/W"/>
	<bitfield id="SECTOR_1" width="1" begin="1" end="1" resetval="0x0" description="Set to 1 if syndrome polynomial 1 is part of the page in page mode Must be 0 in continuous mode" range="1" rwaccess="R/W"/>
	<bitfield id="SECTOR_0" width="1" begin="0" end="0" resetval="0x0" description="Set to 1 if syndrome polynomial 0 is part of the page in page mode Must be 0 in continuous mode" range="0" rwaccess="R/W"/>
	</register><register id="ELM_SYNDROME_FRAGMENT_0_j" acronym="ELM_SYNDROME_FRAGMENT_0_j" offset="1024" width="32" description="Input syndrome polynomial bits 0 to 31.">
		<bitfield id="SYNDROME_0" width="32" begin="31" end="0" resetval="0x0" description="Syndrome bits 0 to 31" range="31:0" rwaccess="R/W"/>
	</register><register id="ELM_SYNDROME_FRAGMENT_1_j" acronym="ELM_SYNDROME_FRAGMENT_1_j" offset="1028" width="32" description="Input syndrome polynomial bits 32 to 63.">
		<bitfield id="SYNDROME_1" width="32" begin="31" end="0" resetval="0x0" description="Syndrome bits 32 to 63" range="31:0" rwaccess="R/W"/>
	</register><register id="ELM_SYNDROME_FRAGMENT_2_j" acronym="ELM_SYNDROME_FRAGMENT_2_j" offset="1032" width="32" description="Input syndrome polynomial bits 64 to 95.">
		<bitfield id="SYNDROME_2" width="32" begin="31" end="0" resetval="0x0" description="Syndrome bits 64 to 95" range="31:0" rwaccess="R/W"/>
	</register><register id="ELM_SYNDROME_FRAGMENT_3_j" acronym="ELM_SYNDROME_FRAGMENT_3_j" offset="1036" width="32" description="Input syndrome polynomial bits 96 to 127">
		<bitfield id="SYNDROME_3" width="32" begin="31" end="0" resetval="0x0" description="Syndrome bits 96 to 127" range="31:0" rwaccess="R/W"/>
	</register><register id="ELM_SYNDROME_FRAGMENT_4_j" acronym="ELM_SYNDROME_FRAGMENT_4_j" offset="1040" width="32" description="Input syndrome polynomial bits 128 to 159.">
		<bitfield id="SYNDROME_4" width="32" begin="31" end="0" resetval="0x0" description="Syndrome bits 128 to 159" range="31:0" rwaccess="R/W"/>
	</register><register id="ELM_SYNDROME_FRAGMENT_5_j" acronym="ELM_SYNDROME_FRAGMENT_5_j" offset="1044" width="32" description="Input syndrome polynomial bits 160 to 191.">
		<bitfield id="SYNDROME_5" width="32" begin="31" end="0" resetval="0x0" description="Syndrome bits 160 to 191" range="31:0" rwaccess="R/W"/>
	</register><register id="ELM_SYNDROME_FRAGMENT_6_j" acronym="ELM_SYNDROME_FRAGMENT_6_j" offset="1048" width="32" description="Input syndrome polynomial bits 192 to 207.">
		<bitfield id="SYNDROME_VALID" width="1" begin="16" end="16" resetval="0x0" description="Syndrome valid bit 0x0: this syndrome polynomial should not be processed 0x1: this syndrome polynomial must be processed" range="16" rwaccess="R/W"/>
	<bitfield id="SYNDROME_6" width="16" begin="15" end="0" resetval="0x0" description="Syndrome bits 192 to 207" range="15:0" rwaccess="R/W"/>
	</register><register id="ELM_LOCATION_STS_j" acronym="ELM_LOCATION_STS_j" offset="2048" width="32" description="Exit status for the syndrome polynomial processing">
		<bitfield id="ECC_CORRECTABLE" width="1" begin="8" end="8" resetval="0x0" description="Error location process exit status 0x0: ECC error location process failed Number of errors and error locations are invalid 0x1: all errors were successfully located Number of errors and error locations are valid" range="8" rwaccess="R"/>
	<bitfield id="ECC_NB_ERRORS" width="5" begin="4" end="0" resetval="0x0" description="Number of errors detected and located" range="4:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_0_j" acronym="ELM_ERROR_LOCATION_0_j" offset="2176" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_1_j" acronym="ELM_ERROR_LOCATION_1_j" offset="2180" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_2_j" acronym="ELM_ERROR_LOCATION_2_j" offset="2184" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_3_j" acronym="ELM_ERROR_LOCATION_3_j" offset="2188" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_4_j" acronym="ELM_ERROR_LOCATION_4_j" offset="2192" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_5_j" acronym="ELM_ERROR_LOCATION_5_j" offset="2196" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_6_j" acronym="ELM_ERROR_LOCATION_6_j" offset="2200" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_7_j" acronym="ELM_ERROR_LOCATION_7_j" offset="2204" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_8_j" acronym="ELM_ERROR_LOCATION_8_j" offset="2208" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_9_j" acronym="ELM_ERROR_LOCATION_9_j" offset="2212" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_10_j" acronym="ELM_ERROR_LOCATION_10_j" offset="2216" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_11_j" acronym="ELM_ERROR_LOCATION_11_j" offset="2220" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_12_j" acronym="ELM_ERROR_LOCATION_12_j" offset="2224" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_13_j" acronym="ELM_ERROR_LOCATION_13_j" offset="2228" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_14_j" acronym="ELM_ERROR_LOCATION_14_j" offset="2232" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register><register id="ELM_ERROR_LOCATION_15_j" acronym="ELM_ERROR_LOCATION_15_j" offset="2236" width="32" description="Error location register">
		<bitfield id="ECC_ERROR_LOCATION" width="13" begin="12" end="0" resetval="0x0" description="Error location bit address" range="12:0" rwaccess="R"/>
	</register>
</module>